"use strict";

/**********************************************************************************************
 * @FileName  : axiosUtil.js
 * @Date      : 2019-08-13
 * @Author    : kuk
 * @설명      : 공통유틸
 **********************************************************************************************/

export class AxiosUtil {

    /**********************************************************************************************
     * @Method 설명 : axios header setting
     * @작성일   : 2019-08-13
     * @작성자   : kuk
     * @변경이력  :
     **********************************************************************************************/
    static getHeader(param = {key : 'Authorization'}) {
        return {
            headers : {
                Authorization: CookieUtil.getCookie(param.key)
            }
        }
    }

    /**********************************************************************************************
     * @Method 설명 : axios error alert
     * @작성일   : 2019-08-23
     * @작성자   : kuk
     * @변경이력 :
     **********************************************************************************************/
    static axiosAlert(param = {}){
        if( _.isEmpty(param) ){
            // 비어있을땐 실행 하지 않는다.
            return false;
        }else{
            alert(param.response.data.errorMessage);
            return true;
        }
    }
}